* TD51
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                           | td51
Descriptive Name                      | 
Area                                  | Paakitsoq / Swiss Camp
Data reference                        | Unknown PDF: See td1 and Lüthi (2015)
Data DOI                              | 
Science reference                     | 
Science DOI                           | 
Date                                  | 1990-06-09
Longitude [°E]                        | -49.3
Latitude [°N]                         | 69.566
Location source                       | Unknown PDF: See td1 and Lüthi (2015)
Depth of top measurement [m]          | 5.0
Depth of bottom measurement [m]       | 600.0
Ice thickness [m]                     | >600
Coverage [% of thickness]             | #VALUE!
Ice thickness source                  | Unknown PDF: See td1 and Lüthi (2015)
Measured from: Top, Bottom, Relative  | T
General_Note                          | 
Temperature_note                      | 
Thickness_note                        | 
Location_note                         | 
#+end_example

** Temperature

+ See td1 Shallow88II.pdf and [[citet:luthi_2015][Lüthi (2015)]]

** Thickness

+ From PDF
 
** Location

+ From PDF

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv
#+END_SRC

#+RESULTS: ingest_data
|   d |     t |
|   5 |  -8.3 |
|  10 |  -9.3 |
|  15 |  -8.7 |
|  35 |  -8.3 |
| 135 |   -10 |
| 235 | -11.9 |
| 350 | -16.6 |
| 450 | -18.5 |
| 550 | -19.6 |
| 590 | -20.4 |
| 595 | -20.3 |
| 600 | -19.9 |

